app/Filters/AuthFilter.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '1'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        // Check if user is logged in
        if (!session()->get('logged_in')) {
            session()->setFlashdata('error', 'Please login to access this page.');
            return redirect()->to('/login');
        }

        // Optional: Check if email is verified
        $userModel = new \App\Models\UserModel();
        $user = $userModel->find(session()->get('user_id'));