app/Controllers/AuthController.php

INSERT INTO `users` (`username`, `full_name`, `email`, `email_verified`, `created_at`, `updated_at`) VALUES ('Brosamack', 'Elik Samuel', 'samuelkiiraeluk@gmail.com', 0, '2025-09-25 20:05:43', '2025-09-25 20:05:43')
DELETE FROM `users`
WHERE `id` IN (2)
---
    public function registerNewUser()
    {
        $validation = \Config\Services::validation();

        $rules = [
            'username' => 'required|min_length[3]|max_length[100]|is_unique[users.username]',
            'full_name' => 'required|min_length[3]|max_length[255]',
            'email' => 'required|valid_email|is_unique[users.email]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Create user without password
        $userData = [
            'username' => $this->request->getPost('username'),
            'full_name' => $this->request->getPost('full_name'),
            'email' => $this->request->getPost('email'),
            'email_verified' => 0
        ];

        $userId = $this->userModel->insert($userData);

        if ($userId) {
            // Generate and send magic link
            if ($this->sendMagicLink($userId, $userData['email'])) {
                return redirect()->to('/register/success')->with('success', 'Magic link sent to your email!');
            } else {
                // Delete user if email fails
                $this->userModel->delete($userId);

UPDATE `users` SET `magic_link_token` = 'c4327e33f0efe529d3fc3d9770c79212303e3927e51ed57342452a7314b3bf15', `token_expires` = '2025-09-25 21:05:43', `updated_at` = '2025-09-25 20:05:43'
WHERE `users`.`id` IN (3)
---
    private function sendMagicLink($userId, $userEmail)
    {
        try {
            $token = bin2hex(random_bytes(32));
            $expires = date('Y-m-d H:i:s', strtotime('+1 hour'));

            $this->userModel->update($userId, [
                'magic_link_token' => $token,
                'token_expires' => $expires
            ]);