app/Controllers/AuthController.php

    public function loginLogic()
    {
        // Validate input
        $validation = \Config\Services::validation();
        $validation->setRules([
            'email' => 'required|valid_email'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('error', 'Please provide a valid email address');
        }

        $email = $this->request->getPost('email');

        // Check if user exists
        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'samuelkiiraeluk@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1