app/Controllers/CompanyController.php

    public function index()
    {
        $data = [
            'title' => 'Companies - LaFab AI Posting',
            'companies' => $this->companyModel->findAll()
---
SELECT *
FROM `companies`
WHERE `companies`.`deleted_at` IS NULL

            ];

            // Save to database
            $companyId = $this->companyModel->insert($data);

            if ($companyId) {
                $company = $this->companyModel->find($companyId);
---
INSERT INTO `companies` (`company_name`, `contact_name`, `contact_email`, `contact_phone`, `company_size`, `address1`, `logo`, `created_at`, `updated_at`) VALUES ('Leading company in Restaurant, hospitality, travel', 'qwert', '', '', '', '', '', '2025-09-28 11:37:37', '2025-09-28 11:37:37')
SELECT *
FROM `companies`
WHERE `companies`.`deleted_at` IS NULL
AND `companies`.`id` = 4