app/Controllers/JobParser.php

    public function processJobDescription()
    {
        $rawInput = file_get_contents('php://input');
        log_message('info', 'Raw input received: ' . $rawInput);

        $data = $this->request->getJSON(true);

        if (!$data || !isset($data['job_data'])) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Invalid JSON data'
            ]);
        }

        $jobData = $data['job_data'];
        $companyId = $data['companyId'] ?? null;
        $userId = session()->get('user_id');
        $companyName = $data['companyName'] ?? null;

        if (!$companyId || !$userId) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Missing company_id or user_id'
            ]);
        }

        // Validate company exists and matches the name
        $company = $this->companyModel->find($companyId);
---
SELECT *
FROM `companies`
WHERE `companies`.`deleted_at` IS NULL
AND `companies`.`id` = '3'